Repository: usama-chr/umocplayer
Catalog: locale/umocplayer.*.po
Languages: ru

source: Clear
ru: Очистить

source: Delete
ru: Удалить

source: Lyrics
ru: Текст песни

source: Refresh filelist
ru: Обновить список файлов

source: Add to playlist
ru: Добавить в плейлист

# tform1.caption
source: Player
ru: Плеер

source: Files
ru: Файлы

source: Time
ru: Время

source: Select (if you edit manually, just close the window)
ru: Выбрать (если редактируете вручную - просто закройте окно)

source: Delete duplicates from a playlist
ru: Удалить дубли из плейлиста

source: Save the playlist to a file
ru: Сохранить плейлист в файл

source: Load a playlist
ru: Загрузить плейлист

source: Settings
ru: Настройки

source: Store the playlist in the music folder (for syncing with other devices)
ru: Хранить плейлист в папке с музыкой (для синхронизации с другими устройствами)

source: The names of the buttons are in Unicode characters (it doesn't work everywhere, but I didn't figure out why)
ru: Названия кнопок в символах Юникода (работает не везде, а почему - не разбирался)

source: Logging (~/player_log). Attention! The log is cleared every time the program is started
ru: Логирование (~player.log). Внимание! Лог очищается при каждом запуске программы

source: Patch to the music folder:
ru: Путь к папке с музыкой:

source: Token for genius.com
ru: Токен для genius.com

# unit1.sbuttonlyricsanotherversion
source: Another version (%d of %d is shown)
ru: Другой вариант (показан %d из %d)

# unit1.sbuttonlyricsclose
source: Close
ru: Закрыть

# unit1.sform1caption
source: Player
ru: Плеер

source: Too many missing files. Stopping
ru: Слишком много отсутствующих файлов. Останавливаюсь

source: For some reason, there is no file with the list of links to the lyrics
ru: Почему-то нет файла со списком ссылок на тексты

source: The path to the music folder is not set or does not exist. Please check
ru: Путь к папке с музыкой не установлен или не существует. Проверьте

source: For some reason, there is no file with the list of titles from the site
ru: Почему-то нет файла со списком названий с сайта

source: The copy that was created at the start of the program has been restored
ru: Восстановлена копия, которая была создана при запуске программы

source: The lyrics were not found
ru: Текст не найден

source: 1) Check the tags: look at the window title — if it shows garbled text or is empty, nothing will be found, as this is the data used for the text search; 2) Check your internet connection; 3) Verify that the lyrics exists on the website genius.com — the program searches for songs there; 4) Did you enter your token for genius.com in the settings? Visit https://genius.com/api-clients to register.
ru: 1) Проверьте теги: посмотрите на заголовок окна - если там крякозябры или пусто, то ничего найдено не будет - именно по этим данным ищется текст; 2) Проверьте соединение с интернетом; 3) Проверьте, есть ли текст на сайте genius.com - именно там программа ищет песни; 4) Вы ввели в настройках токен для genius.com? Посетите https://genius.com/api-clients для регистрации.

source: The path has been changed, starting to update the file list
ru: Путь изменён, запускаю обновление списка файлов
